package com.example.myapplication;

public class QuestionAnswer {

    public static String question[] ={
            "Имеются ли у вас необходимые инструменты и ресурсы для эффективного выполнения вашей работы? ",
            "Довольны ли вы чистотой и организацией рабочего места?",
            "Четко ли определены и доведены ли до вас ваши задачи?",
            "Есть ли у вас возможности принять новые вызовы и расширить свои навыки?",
            "Считаете ли вы, что ваша работа дает ощущение цели и удовлетворения?",
            "Удовлетворены ли вы уровнем полномочий по принятию решений, которые вы имеете на своей должности?",
            "Имеются ли у вас четкие инструкции и ожидания относительно ваших рабочих задач и проектов?",
            "Получаете ли вы конструктивную обратную связь и рекомендации по своей работе?",
            "Чувствуете ли вы, что ваш руководитель ценит ваш вклад и признает ваши усилия?",
            "Считаете ли вы, что ваша нынешняя должность соответствует вашим долгосрочным карьерным целям?",
            "Есть ли у вас шанс взять на себя руководящие роли или специальные проекты?",
            "Считаете ли вы, что ваш вклад и достижения должным образом вознаграждены?",
            "Как бы вы оценили прозрачность и справедливость процесса оценки эффективности и вознаграждения?",
            "Чувствуете ли вы чувство товарищества и командной работы в своем отделе?",
            "Удовлетворены ли вы уровнем уважения и сотрудничества между вашими коллегами?",
            "Есть ли у вас возможность взаимодействовать с коллегами из разных отделов или команд?",
            "Вам удобно искать помощь или ресурсы для решения личных или связанных с работой проблем?",
            "Довольны ли вы физической рабочей средой с точки зрения комфорта, освещения и эргономики?",
            "Считаете ли вы, что компания ценит и ставит во главу угла благополучие своих сотрудников?",


    };

    public static String choices[][] = {
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"},
            {"Да","Нет"}
    };

    public static String correctAnswers[] = {
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да",
            "Да"
    };

}